app/Controllers/Home.php

    public function index()
    {
        if (session('id')) {
            return redirect()->to(site_url('Admin/dashboard'));
        }

        $home = $this->HomeModel->findAll();
        $testimoni = $this->TestimonialModel->findAll();
---
SELECT *
FROM `home`
SELECT *
FROM `testimonial`